[
  {
    "author": "Hayden Read",
    "title": "Journeys Are Best Measured In New Friends",
    "description": "We love to travel, we love writing about travel, and we love hosting events that bring other travelers together.As an independent website, we pay our own way when we travel. We don’t do sponsored content or big brand deals. You won’t see us talking about detox teas on Instagram.No. We travel like YOU travel so that when it’s time for you to plan your next trip, the information you get reflects the reality of what you’ll experience on the road.This membership program allows you to get even more out of this website while paying for itself through exclsive tips and discounts (saving you money is kind of our jam!)With Nomadic Matt Plus, you’re part of a community within a community. Plus, 10% of all membership subscriptions go towards our community charity, FLYTE, which helps students from underserved communities take transformative trips abroad.In short, a membership levels up your travel experience!Set in the center of town near bars, restaurants, and coffee spots, this hostel is about as lively a place as you’ll find in the northern town of Akureyri. The in-house bar serves up a few different local brews on tap and also a menu of non-Icelandic comfort food/tummy fillers like burgers and nachos.There are 103 beds on three floors, consisting of mixed dorms, single-gender dorms, and private rooms. The dorm beds here are basic and not super comfy but there are lockers and the rooms are relatively spacious. The kitchen is fully equipped and there’s even a sauna!",
    "image": "https://wanderers.qodeinteractive.com/wp-content/uploads/2018/02/blog-post-1.jpg",
    "email": "hayden@gmail.com",
    "date": "April 12, 2020",
    "star": 5
  },
  {
    "author": "Quinn Nolan",
    "title": "A Lot Of Traveling Turns You Into A Storyteller",
    "description": "I juggle three main plates: travel, work, and wanting a settled life in Austin. I am still perpetually pulled to new destinations and intrigued by long trips (“India? Well, I can only really see it if I go for six months, so I guess it’s time to give up that apartment again!”), but I’ve gotten better at learning that I have to accept shorter trips if I want to also have a life in Austin. I’ve talked about my anxiety in the past, and, when I started my first Europe adventure this year, it (and the eye twitch that comes with it) returned in full force. My work and travel lives were unbalanced within weeks of being on the road.Then I decided to finally make a big change: I upgraded my accommodations. I started staying in nicer guesthouses and hotels instead of cheap hostels and dorm rooms. It made a huge difference because having a good space to work from and not running around looking for Wi-Fi has made my days a lot less stressful. Better accommodation has also led to better sleep and a drop in my anxiety levels. ",
    "image": "https://wanderers.qodeinteractive.com/wp-content/uploads/2018/02/blog-post-4.jpg",
    "email": "nolan@gmail.com",
    "date": "February 3, 2021",
    "star": 4.5
  },
  {
    "author": "Rauthor jack",
    "title": "Travel Makes One Modest And Opened To Ideas",
    "description": "“Fuck Airbnb,” I said to myself as I read one of their customer service replies. Despite having documentation that my host hadn’t paid the refund they agreed to give me, Airbnb decided to side with the host and wouldn’t issue me the refund. This was the second time in several months I had to call customer service — and the second time they sided with the host.When I started traveling last summer, I decided to use Airbnb again. I still thought it had a ton of unresolved problems but, in places where hotels are limited, it is often the best and cheapest accommodation option. (Despite my issues with the company itself, they do list some really great accommodation on the website.) While I was in the Finger Lakes area (a wine region in upstate NY that is just absolutely wonderful), I woke up to an email from Airbnb saying my friend and I had to leave our lodging right away and that my account was now frozen. I had no idea what was going on. The host was equally confused by the situation but was happy to let me stay until I resolved it.    ",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2022/01/weeklyupdatela1-335x200.jpg",
    "date": "September 9, 2021",
    "star": 5
  },
  {
    "author": "Vbhany Rudhuro",
    "title": "Think Of How Things Should Be And Act Upon",
    "description": "It turned out that because my phone number was on two accounts, during an automatic review, their system froze them both, thinking this was part of some kind of fraud. And that triggered the email, which, when unanswered, triggered the phone call. Why couldn’t they just tell me that on the phone? It seemed weird their procedure was not to ask “Hey can you clear this up for us” but to say “Your account is frozen. Leave now!” My account was restored, but I was left thinking, “What if this had happened to someone who didn’t have the CEO’s number?” Imagine a family on holiday being told they had to leave but not why. (Heck, one of my team members had her account suspended a few years ago and was never informed why. They won’t give her the account back. She just woke up one day and was told, “Sorry, you’re off our platform.Located in Snæfellsbær in western Iceland, The Freezer isn’t big: it has four rooms and can accommodate just 22 travelers. But what it lacks in size it makes up for in fun. This is an artsy, laid-back backpacker hostel where it’s easy to meet people and socialize. The in-house tiki bar is lively, particularly during the 6–8pm happy hour. Common areas have ample board games, and there are regularly scheduled events like film screenings, pub quizzes, and live music.",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2021/11/weeklyupdatearuba1-335x200.jpg",
    "email": "jhon@rock.com",
    "date": "January 4, 2022",
    "star": 4
  },
  {
    "author": "Jonny Patyni",
    "title": "Live Now As If You’d Drop Dead In Ten Seconds",
    "description": "The undulating sand dunes. The camel rides. The hikes through the Atlas Mountains. The bustling medinas. The couscous-laced dishes. The seemingly endless mint tea. And, of course, the super friendly and welcoming people. Morocco will change and challenge you.It can be sensory overload at times, but it’s well worth your time and money to get yourself to Morocco. I fell in love with it as soon as I arrived.It’s not always easy to get around this country of 37 million people. For new travelers, Morocco’s up-close and personal nature can be a challenge. The country is a battery on your senses and, for those without a lot of travel experience, that can be overwhelming, which is why jumping on an organized tour might be one of the best ways to see it for the first time.I took the two-week Best of Morocco tour with Intrepid Travel, which was a blast and a great primer. While I loved my tour (it’s an amazing company!), it isn’t the only option. There are other good travel companies that can take you around the countryside and to all the greatest sites of this fantastic nation.It’s a very social hostel and the bar area makes it easy to meet people. The complex is also the long-term home of artists and designers, adding a hip, creative element to the place. There’s a heated outdoor terrace, as well as kitchen facilities. It’s also centrally located making it easy to get around the city.",
    "image": "https://wanderers.qodeinteractive.com/wp-content/uploads/2018/02/blog-post-7.jpg",
    "email": "jonny@patyni.com",
    "date": "January 4, 2022",
    "star": 4
  },
  {
    "author": "Mk Agarwal",
    "title": "Begin The Real Voyage Of Discovery Right Now",
    "description": "Intrepid is my favorite multiday, small-group tour operator out there (with which I went to Morocco, Jordan, and Madagascar). I always have an incredible time on its tours. I really love the guides, off-the-beaten-track itineraries, and commitment to the local community.Intrepid also is environmentally friendly, uses local guides and transportation, doesn’t rush the tours, and is quite inexpensive (tours start for as little as $383 and go up to $7,600 per person, based on the tour and the length of time). The tours get a good mix of young and older travelers and balance being both fun and educational. You learn a lot without it feeling boring. I can’t recommend it enough!This company has been leading travelers around the sand dunes, narrow streets, medinas, and mosques of Morocco for close to two decades. One nice thing about Nomadic Tours is that it will never cancel the tour if enough people don’t sign up. Just two people? The tour is still on! It also doesn’t charge you a single supplement if you’re solo.The company offers the usual highlight tours, but also ones aimed at teen travelers, families, and hikers (for example, there’s an 11-day trekking trip with Berbers in the Atlas Mountains). There are a dozen on offer, ranging from 5 to 15 days, using local guides.",
    "image": "https://wanderers.qodeinteractive.com/wp-content/uploads/2018/02/blog-post-8.jpg",
    "email": "mk@rock.com",
    "date": "January 4, 2022",
    "star": 4
  },
  {
    "author": "Robi Hayder",
    "title": "Journeys Are Best Measured In New Friends",
    "description": "We love to travel, we love writing about travel, and we love hosting events that bring other travelers together.As an independent website, we pay our own way when we travel. We don’t do sponsored content or big brand deals. You won’t see us talking about detox teas on Instagram.No. We travel like YOU travel so that when it’s time for you to plan your next trip, the information you get reflects the reality of what you’ll experience on the road.This membership program allows you to get even more out of this website while paying for itself through exclsive tips and discounts (saving you money is kind of our jam!)With Nomadic Matt Plus, you’re part of a community within a community. Plus, 10% of all membership subscriptions go towards our community charity, FLYTE, which helps students from underserved communities take transformative trips abroad.In short, a membership levels up your travel experience!Set in the center of town near bars, restaurants, and coffee spots, this hostel is about as lively a place as you’ll find in the northern town of Akureyri. The in-house bar serves up a few different local brews on tap and also a menu of non-Icelandic comfort food/tummy fillers like burgers and nachos.There are 103 beds on three floors, consisting of mixed dorms, single-gender dorms, and private rooms. The dorm beds here are basic and not super comfy but there are lockers and the rooms are relatively spacious. The kitchen is fully equipped and there’s even a sauna!",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2021/11/matt_africa2-335x200.jpeg",
    "email": "hayden@gmail.com",
    "date": "April 12, 2020",
    "star": 5
  },
  {
    "author": "Olivar Thomas",
    "title": "My friend Earl from Wandering Earl runs an epic tour across Morocco. Over the course of 14 days, you’ll see all the highlights, spend time with Berber and Bedouin communities, and take a 4WD adventure over barren sand dunes. His tours are small (they’re capped at 12 people) and they also offer single supplements for anyone wanting a private room (for an additional cost). Like me, Earl has been traveling the world for over a decade and knows what makes a good tour. You can’t go wrong with his company.This operator offers tours from various cities in Morocco. So, if you’re based in, say, Marrakech or Fes or Tangier or Casablanca, you can jump on a two-day or weeklong tour of another part of the country. There are also tours lasting up to 30 days, so chances are there’s an itinerary that suits your needs.The company also offers private tours. While that might not be as cheap, you’ll be able to plan the trip exactly as you see fit. This is a great option for independent travelers who want the flexibility of designing their own excursion but the comfort and safety of going with a company.This company only does bike tours: road bikes, mountain bikes, and e-bikes. Most are moderately challenging, so you’ll need to be in decent shape. However, you don’t need to be a professional cyclist — beginners are welcome!Pedal through valleys in the mountains and stop in remote Berber villages to chat with the locals. Or do a nine-day bike excursion from the fabled Atlas Mountains to the coast. It also offers several single-day tours in case you just want to add in a day of biking to your existing itinerary. These day trips are easy or mildly difficult and suitable for beginners too.",
    "image": "https://wanderers.qodeinteractive.com/wp-content/uploads/2018/02/blog-post-2.jpg",
    "email": "thomas@gmail.com",
    "date": "December 15, 2020",
    "star": 5
  },
  {
    "author": "Olyvhar Roy",
    "title": "Begin The Real Voyage Of Discovery Right Now",
    "description": "Intrepid is my favorite multiday, small-group tour operator out there (with which I went to Morocco, Jordan, and Madagascar). I always have an incredible time on its tours. I really love the guides, off-the-beaten-track itineraries, and commitment to the local community.Intrepid also is environmentally friendly, uses local guides and transportation, doesn’t rush the tours, and is quite inexpensive (tours start for as little as $383 and go up to $7,600 per person, based on the tour and the length of time). The tours get a good mix of young and older travelers and balance being both fun and educational. You learn a lot without it feeling boring. I can’t recommend it enough!This company has been leading travelers around the sand dunes, narrow streets, medinas, and mosques of Morocco for close to two decades. One nice thing about Nomadic Tours is that it will never cancel the tour if enough people don’t sign up. Just two people? The tour is still on! It also doesn’t charge you a single supplement if you’re solo.The company offers the usual highlight tours, but also ones aimed at teen travelers, families, and hikers (for example, there’s an 11-day trekking trip with Berbers in the Atlas Mountains). There are a dozen on offer, ranging from 5 to 15 days, using local guides.",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2021/11/costa-rica-volcano-335x200.jpeg",
    "email": "mk@rock.com",
    "date": "January 4, 2022",
    "star": 4
  },
  

  {
    "author": "Sammy Peters",
    "title": " The Road To Quitobaquito Springs",
    "description": "It’s no secret the world has changed a lot over the past 20 years. In few areas is that more true than the business world specifically- when and where we work. There has never been more opportunities to find a ‘non-traditional’ job (working outside the traditional 9-5 schedule) or ways to make money from anywhere in the world. Thanks to the advancements in technology and how business is being done, a group of people is choosing to live the lives they have always dreamed of wherever they want to live them. The group is called “Digital Nomads” and they are changing the ‘live to work’ narrative into very much “working to live.”It’s becoming more and more common to hear about digital nomads and, for some, even trying to set themselves up as one. Usually, this involves choosing to live frugally and creating (innovative) ways to make money regardless of your physical location. Digital nomads believe that living/working from wherever they want in the world is the ultimate dream and sign of freedom drastically increasing quality of life.Related: Best Travel BooksWe won’t be covering the different revenue streams that make the digital nomad life possible, but will instead highlight the best digital nomad destinations and the best places to work remote in the world.  ",
    "image": "https://c0.wallpaperflare.com/preview/979/961/156/adventure-travel-hiking-mountain.jpg",
    "date": "September 20, 2019",
    "star": 5
  },
  {
    "author": "Jaynual Adnan",
    "title": " The Road To Quitobaquito Springs",
    "description": "It’s no secret the world has changed a lot over the past 20 years. In few areas is that more true than the business world specifically- when and where we work. There has never been more opportunities to find a ‘non-traditional’ job (working outside the traditional 9-5 schedule) or ways to make money from anywhere in the world. Thanks to the advancements in technology and how business is being done, a group of people is choosing to live the lives they have always dreamed of wherever they want to live them. The group is called “Digital Nomads” and they are changing the ‘live to work’ narrative into very much “working to live.”It’s becoming more and more common to hear about digital nomads and, for some, even trying to set themselves up as one. Usually, this involves choosing to live frugally and creating (innovative) ways to make money regardless of your physical location. Digital nomads believe that living/working from wherever they want in the world is the ultimate dream and sign of freedom drastically increasing quality of life.Related: Best Travel BooksWe won’t be covering the different revenue streams that make the digital nomad life possible, but will instead highlight the best digital nomad destinations and the best places to work remote in the world.  ",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2021/10/lisbonmain1-335x200.jpeg",
    "date": "September 20, 2019",
    "star": 5
  },
  {
    "author": "Mirjja Abdhul",
    "title": "Tugela Gorge Hike In The Stunning Drakensberg",
    "description": "I’m not going to lie: I think I have a pretty good travel blog. You probably do too if you’re here and if you’re like me, then you already understand the importance of curating your social media and inbox to only include the best of the best when it comes to travel blogs and travel-related content. If so, let’s get straight to the best travel blogs of 2021→ You have a busy life and other things to do, so while you may have the best of intentions when signing up for a newsletter, you can also easily find yourself inundated with advice and “hacks” that aren’t necessarily relevant to you.Why should I use (and support) travel blogs? Travel blogs can be rich with highly in-depth travel and destination information that could prove very very helpful when it comes to dreaming about, planning and executing travel.These are great resources for a variety of audiences, from students to nomads, budget backpackers to travel agencies, and beyond.Travel logs didn’t used to be so popular. Let’s be honest. Even 5 to 10 years ago, if one of your friends told you they were going to start a blog, would you not respond with a tired groan?RELATED: MY BUCKET LIST AND IDEAS FOR YOURS But over the years, as more and more people choose to spearhead their own adventures rather than opting for a professional travel advisor, free online resources like travel blogs became an integral part of the planning process.At the end of the day, reading a good travel blog should feel like you’re getting advice from a personal friend who knows what you like and what you don’t.  ",
    "image": "https://www.adventureshow.com/wp-content/uploads/2019/11/A-person-standing-at-night-looking-up-at-the-Northern-Lights.jpg",
    "date": "june 9, 2021",
    "star": 5
  },
  {
    "author": "Arndy Rakhtam",
    "title": "Tugela Gorge Hike In The Stunning Drakensberg",
    "description": "I’m not going to lie: I think I have a pretty good travel blog. You probably do too if you’re here and if you’re like me, then you already understand the importance of curating your social media and inbox to only include the best of the best when it comes to travel blogs and travel-related content. If so, let’s get straight to the best travel blogs of 2021→ You have a busy life and other things to do, so while you may have the best of intentions when signing up for a newsletter, you can also easily find yourself inundated with advice and “hacks” that aren’t necessarily relevant to you.Why should I use (and support) travel blogs? Travel blogs can be rich with highly in-depth travel and destination information that could prove very very helpful when it comes to dreaming about, planning and executing travel.These are great resources for a variety of audiences, from students to nomads, budget backpackers to travel agencies, and beyond.Travel logs didn’t used to be so popular. Let’s be honest. Even 5 to 10 years ago, if one of your friends told you they were going to start a blog, would you not respond with a tired groan?RELATED: MY BUCKET LIST AND IDEAS FOR YOURS But over the years, as more and more people choose to spearhead their own adventures rather than opting for a professional travel advisor, free online resources like travel blogs became an integral part of the planning process.At the end of the day, reading a good travel blog should feel like you’re getting advice from a personal friend who knows what you like and what you don’t.  ",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2021/10/croatiathingsmain-335x200.jpg",
    "date": "june 9, 2021",
    "star": 5
  },
  {
    "author": "Ricky Ponty",
    "title": "Don’t Be Disappointed By The Things You Didn’t Do",
    "description": "That beauty, however, comes at a price. Iceland is very expensive. It doesn’t take much to blow your budget here, even if you’re a frugal traveler like me. Fortunately, the Land of Fire and Ice has a well-worn backpacker trail dotted with hostels that can make your visit more affordable.Before we dive in, there are a lot of things to consider when selecting a hostel. After over a decade of backpacking around the world, I’ve learned what makes a good hostel great. The top four factors are Location Iceland is spread out, and it can take some time to get around. Pick a place that is near the sites you want to see and/or the nightlife you want to experience. All the hostels listed here are centrally located.2. Price – In Iceland, you really get what you pay for, so if you go with a really cheap hostel, you’re probably going to get one that is cramped and doesn’t offer great service. 3. Amenities – Most hostels offer free Wi-Fi, and some even include free breakfast, but if you want more than that, do your research in order to find one that best meets your needs Staff – All the hostels listed here have an amazing staff! They are super friendly and knowledgeable. Even if you don’t stay at one of the places listed below, look up reviews to ensure you end up somewhere where the staff are helpful and friendly! They can make or break a hostel! To help you plan your trip, below is my list of the best hostels in Iceland. They all offer a welcome respite and a cozy and friendly place to lay your weary head and hang out with fellow travelers — all while keeping your budget intact.",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2018/12/giftguide2-400x234.jpg",
    "email": "david@smith.com",
    "date": "May 5, 2021",
    "star": 4.5
  },
  {
    "author": "David Smith",
    "title": "Don’t Be Disappointed By The Things You Didn’t Do",
    "description": "That beauty, however, comes at a price. Iceland is very expensive. It doesn’t take much to blow your budget here, even if you’re a frugal traveler like me. Fortunately, the Land of Fire and Ice has a well-worn backpacker trail dotted with hostels that can make your visit more affordable.Before we dive in, there are a lot of things to consider when selecting a hostel. After over a decade of backpacking around the world, I’ve learned what makes a good hostel great. The top four factors are Location Iceland is spread out, and it can take some time to get around. Pick a place that is near the sites you want to see and/or the nightlife you want to experience. All the hostels listed here are centrally located.2. Price – In Iceland, you really get what you pay for, so if you go with a really cheap hostel, you’re probably going to get one that is cramped and doesn’t offer great service. 3. Amenities – Most hostels offer free Wi-Fi, and some even include free breakfast, but if you want more than that, do your research in order to find one that best meets your needs Staff – All the hostels listed here have an amazing staff! They are super friendly and knowledgeable. Even if you don’t stay at one of the places listed below, look up reviews to ensure you end up somewhere where the staff are helpful and friendly! They can make or break a hostel! To help you plan your trip, below is my list of the best hostels in Iceland. They all offer a welcome respite and a cozy and friendly place to lay your weary head and hang out with fellow travelers — all while keeping your budget intact.",
    "image": "https://wanderers.qodeinteractive.com/wp-content/uploads/2018/02/blog-post-3.jpg",
    "email": "david@smith.com",
    "date": "May 5, 2021",
    "star": 4.5
  },
  {
  "author": "Lala khanom",
    "title": "Journeys Are Best Measured In New Friends",
    "description": "We love to travel, we love writing about travel, and we love hosting events that bring other travelers together.As an independent website, we pay our own way when we travel. We don’t do sponsored content or big brand deals. You won’t see us talking about detox teas on Instagram.No. We travel like YOU travel so that when it’s time for you to plan your next trip, the information you get reflects the reality of what you’ll experience on the road.This membership program allows you to get even more out of this website while paying for itself through exclsive tips and discounts (saving you money is kind of our jam!)With Nomadic Matt Plus, you’re part of a community within a community. Plus, 10% of all membership subscriptions go towards our community charity, FLYTE, which helps students from underserved communities take transformative trips abroad.In short, a membership levels up your travel experience!Set in the center of town near bars, restaurants, and coffee spots, this hostel is about as lively a place as you’ll find in the northern town of Akureyri. The in-house bar serves up a few different local brews on tap and also a menu of non-Icelandic comfort food/tummy fillers like burgers and nachos.There are 103 beds on three floors, consisting of mixed dorms, single-gender dorms, and private rooms. The dorm beds here are basic and not super comfy but there are lockers and the rooms are relatively spacious. The kitchen is fully equipped and there’s even a sauna!",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2021/04/startablognew1-335x200.jpg",
    "email": "hayden@gmail.com",
    "date": "April 12, 2020",
    "star": 5
  },
  {
    "author": "Monky Ronky",
    "title": "A Lot Of Traveling Turns You Into A Storyteller",
    "description": "I juggle three main plates: travel, work, and wanting a settled life in Austin. I am still perpetually pulled to new destinations and intrigued by long trips (“India? Well, I can only really see it if I go for six months, so I guess it’s time to give up that apartment again!”), but I’ve gotten better at learning that I have to accept shorter trips if I want to also have a life in Austin. I’ve talked about my anxiety in the past, and, when I started my first Europe adventure this year, it (and the eye twitch that comes with it) returned in full force. My work and travel lives were unbalanced within weeks of being on the road.Then I decided to finally make a big change: I upgraded my accommodations. I started staying in nicer guesthouses and hotels instead of cheap hostels and dorm rooms. It made a huge difference because having a good space to work from and not running around looking for Wi-Fi has made my days a lot less stressful. Better accommodation has also led to better sleep and a drop in my anxiety levels. ",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2021/10/croatiaitinerarymain-335x200.jpg",
    "email": "nolan@gmail.com",
    "date": "February 3, 2021",
    "star": 4.5
  },
  {
    "author": "Jardon jack",
    "title": "Travel Makes One Modest And Opened To Ideas",
    "description": "“Fuck Airbnb,” I said to myself as I read one of their customer service replies. Despite having documentation that my host hadn’t paid the refund they agreed to give me, Airbnb decided to side with the host and wouldn’t issue me the refund. This was the second time in several months I had to call customer service — and the second time they sided with the host.When I started traveling last summer, I decided to use Airbnb again. I still thought it had a ton of unresolved problems but, in places where hotels are limited, it is often the best and cheapest accommodation option. (Despite my issues with the company itself, they do list some really great accommodation on the website.) While I was in the Finger Lakes area (a wine region in upstate NY that is just absolutely wonderful), I woke up to an email from Airbnb saying my friend and I had to leave our lodging right away and that my account was now frozen. I had no idea what was going on. The host was equally confused by the situation but was happy to let me stay until I resolved it.    ",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2021/10/austinweeklyupdate-335x200.jpg",
    "date": "September 9, 2021",
    "star": 5
  },
  {
    "author": "Yanur Rajdipp",
    "title": "Think Of How Things Should Be And Act Upon",
    "description": "It turned out that because my phone number was on two accounts, during an automatic review, their system froze them both, thinking this was part of some kind of fraud. And that triggered the email, which, when unanswered, triggered the phone call. Why couldn’t they just tell me that on the phone? It seemed weird their procedure was not to ask “Hey can you clear this up for us” but to say “Your account is frozen. Leave now!” My account was restored, but I was left thinking, “What if this had happened to someone who didn’t have the CEO’s number?” Imagine a family on holiday being told they had to leave but not why. (Heck, one of my team members had her account suspended a few years ago and was never informed why. They won’t give her the account back. She just woke up one day and was told, “Sorry, you’re off our platform.Located in Snæfellsbær in western Iceland, The Freezer isn’t big: it has four rooms and can accommodate just 22 travelers. But what it lacks in size it makes up for in fun. This is an artsy, laid-back backpacker hostel where it’s easy to meet people and socialize. The in-house tiki bar is lively, particularly during the 6–8pm happy hour. Common areas have ample board games, and there are regularly scheduled events like film screenings, pub quizzes, and live music.",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2021/10/memphistc1-335x200.jpeg",
    "email": "jhon@rock.com",
    "date": "January 4, 2022",
    "star": 4
  },
  {
    "author": "Pandit Akhlimon",
    "title": "Live Now As If You’d Drop Dead In Ten Seconds",
    "description": "The undulating sand dunes. The camel rides. The hikes through the Atlas Mountains. The bustling medinas. The couscous-laced dishes. The seemingly endless mint tea. And, of course, the super friendly and welcoming people. Morocco will change and challenge you.It can be sensory overload at times, but it’s well worth your time and money to get yourself to Morocco. I fell in love with it as soon as I arrived.It’s not always easy to get around this country of 37 million people. For new travelers, Morocco’s up-close and personal nature can be a challenge. The country is a battery on your senses and, for those without a lot of travel experience, that can be overwhelming, which is why jumping on an organized tour might be one of the best ways to see it for the first time.I took the two-week Best of Morocco tour with Intrepid Travel, which was a blast and a great primer. While I loved my tour (it’s an amazing company!), it isn’t the only option. There are other good travel companies that can take you around the countryside and to all the greatest sites of this fantastic nation.It’s a very social hostel and the bar area makes it easy to meet people. The complex is also the long-term home of artists and designers, adding a hip, creative element to the place. There’s a heated outdoor terrace, as well as kitchen facilities. It’s also centrally located making it easy to get around the city.",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2021/09/croatiathingsmain1c-335x200.jpeg",
    "email": "jonny@patyni.com",
    "date": "January 4, 2022",
    "star": 4
  },
  {
    "author": "Mk Agarwal",
    "title": "Begin The Real Voyage Of Discovery Right Now",
    "description": "Intrepid is my favorite multiday, small-group tour operator out there (with which I went to Morocco, Jordan, and Madagascar). I always have an incredible time on its tours. I really love the guides, off-the-beaten-track itineraries, and commitment to the local community.Intrepid also is environmentally friendly, uses local guides and transportation, doesn’t rush the tours, and is quite inexpensive (tours start for as little as $383 and go up to $7,600 per person, based on the tour and the length of time). The tours get a good mix of young and older travelers and balance being both fun and educational. You learn a lot without it feeling boring. I can’t recommend it enough!This company has been leading travelers around the sand dunes, narrow streets, medinas, and mosques of Morocco for close to two decades. One nice thing about Nomadic Tours is that it will never cancel the tour if enough people don’t sign up. Just two people? The tour is still on! It also doesn’t charge you a single supplement if you’re solo.The company offers the usual highlight tours, but also ones aimed at teen travelers, families, and hikers (for example, there’s an 11-day trekking trip with Berbers in the Atlas Mountains). There are a dozen on offer, ranging from 5 to 15 days, using local guides.",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2021/09/amsterdamneighborhood1-335x200.jpeg",
    "email": "mk@rock.com",
    "date": "January 4, 2022",
    "star": 4
  },
  {
    "author": "Robi Sorkar Protap",
    "title": "Journeys Are Best Measured In New Friends",
    "description": "We love to travel, we love writing about travel, and we love hosting events that bring other travelers together.As an independent website, we pay our own way when we travel. We don’t do sponsored content or big brand deals. You won’t see us talking about detox teas on Instagram.No. We travel like YOU travel so that when it’s time for you to plan your next trip, the information you get reflects the reality of what you’ll experience on the road.This membership program allows you to get even more out of this website while paying for itself through exclsive tips and discounts (saving you money is kind of our jam!)With Nomadic Matt Plus, you’re part of a community within a community. Plus, 10% of all membership subscriptions go towards our community charity, FLYTE, which helps students from underserved communities take transformative trips abroad.In short, a membership levels up your travel experience!Set in the center of town near bars, restaurants, and coffee spots, this hostel is about as lively a place as you’ll find in the northern town of Akureyri. The in-house bar serves up a few different local brews on tap and also a menu of non-Icelandic comfort food/tummy fillers like burgers and nachos.There are 103 beds on three floors, consisting of mixed dorms, single-gender dorms, and private rooms. The dorm beds here are basic and not super comfy but there are lockers and the rooms are relatively spacious. The kitchen is fully equipped and there’s even a sauna!",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2021/09/madridstay1c-335x200.jpeg",
    "email": "hayden@gmail.com",
    "date": "April 12, 2020",
    "star": 5
  },
  {
    "author": "Sandhip Thomas",
    "title": "My friend Earl from Wandering Earl runs an epic tour across Morocco. Over the course of 14 days, you’ll see all the highlights, spend time with Berber and Bedouin communities, and take a 4WD adventure over barren sand dunes. His tours are small (they’re capped at 12 people) and they also offer single supplements for anyone wanting a private room (for an additional cost). Like me, Earl has been traveling the world for over a decade and knows what makes a good tour. You can’t go wrong with his company.This operator offers tours from various cities in Morocco. So, if you’re based in, say, Marrakech or Fes or Tangier or Casablanca, you can jump on a two-day or weeklong tour of another part of the country. There are also tours lasting up to 30 days, so chances are there’s an itinerary that suits your needs.The company also offers private tours. While that might not be as cheap, you’ll be able to plan the trip exactly as you see fit. This is a great option for independent travelers who want the flexibility of designing their own excursion but the comfort and safety of going with a company.This company only does bike tours: road bikes, mountain bikes, and e-bikes. Most are moderately challenging, so you’ll need to be in decent shape. However, you don’t need to be a professional cyclist — beginners are welcome!Pedal through valleys in the mountains and stop in remote Berber villages to chat with the locals. Or do a nine-day bike excursion from the fabled Atlas Mountains to the coast. It also offers several single-day tours in case you just want to add in a day of biking to your existing itinerary. These day trips are easy or mildly difficult and suitable for beginners too.",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2021/09/sloveniathoughts1a-335x200.jpeg",
    "email": "thomas@gmail.com",
    "date": "December 15, 2020",
    "star": 5
  },
  {
    "author": "Bidhayok Purkaystho",
    "title": "Begin The Real Voyage Of Discovery Right Now",
    "description": "Intrepid is my favorite multiday, small-group tour operator out there (with which I went to Morocco, Jordan, and Madagascar). I always have an incredible time on its tours. I really love the guides, off-the-beaten-track itineraries, and commitment to the local community.Intrepid also is environmentally friendly, uses local guides and transportation, doesn’t rush the tours, and is quite inexpensive (tours start for as little as $383 and go up to $7,600 per person, based on the tour and the length of time). The tours get a good mix of young and older travelers and balance being both fun and educational. You learn a lot without it feeling boring. I can’t recommend it enough!This company has been leading travelers around the sand dunes, narrow streets, medinas, and mosques of Morocco for close to two decades. One nice thing about Nomadic Tours is that it will never cancel the tour if enough people don’t sign up. Just two people? The tour is still on! It also doesn’t charge you a single supplement if you’re solo.The company offers the usual highlight tours, but also ones aimed at teen travelers, families, and hikers (for example, there’s an 11-day trekking trip with Berbers in the Atlas Mountains). There are a dozen on offer, ranging from 5 to 15 days, using local guides.",
    "image": "https://www.nomadicmatt.com/wp-content/uploads/2021/09/barcelonaneighborhood1-335x200.jpeg",
    "email": "mk@rock.com",
    "date": "January 4, 2022",
    "star": 4
  }
]